
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * module.trusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPPrivilegedContainer\nmetadata:\n  name: psp-privileged-container\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;default\&#34;\n  parameters:\n    exemptImages:\n      - gcr.io/k8s-prow/entrypoint:*\n      - gcr.io/k8s-prow/initupload:*\n      - gcr.io/k8s-prow/clonerefs:*\n      - gcr.io/k8s-prow/sidecar:*\n      - \&#34;aquasec/trivy:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/prow/cleaner:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/bootstrap:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/gardener-rotate:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/golangci-lint:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/kyma-integration:*\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev/e2e-nodejs-chrome:*\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project/prod/testimages/e2e-dind-k3d:*\&#34;\n      - \&#34;gcr.io/k8s-prow/generic-autobumper:*\&#34;&#34;]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPPrivilegedContainer\nmetadata:\n  name: psp-privileged-container\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;default\&#34;\n  parameters:\n    exemptImages:\n      - gcr.io/k8s-prow/entrypoint:*\n      - gcr.io/k8s-prow/initupload:*\n      - gcr.io/k8s-prow/clonerefs:*\n      - gcr.io/k8s-prow/sidecar:*\n      - \&#34;aquasec/trivy:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/prow/cleaner:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/bootstrap:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/gardener-rotate:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/golangci-lint:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/kyma-integration:*\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev/e2e-nodejs-chrome:*\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project/prod/testimages/e2e-dind-k3d:*\&#34;\n      - \&#34;gcr.io/k8s-prow/generic-autobumper:*\&#34;&#34;]
* Delete
  * module.trusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPPrivilegedContainer\nmetadata:\n  name: psp-privileged-container\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;default\&#34;\n  parameters:\n    exemptImages:\n      - gcr.io/k8s-prow/entrypoint:*\n      - gcr.io/k8s-prow/initupload:*\n      - gcr.io/k8s-prow/clonerefs:*\n      - gcr.io/k8s-prow/sidecar:*\n      - \&#34;aquasec/trivy:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/prow/cleaner:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/bootstrap:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/gardener-rotate:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/golangci-lint:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/kyma-integration:*\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\&#34;\n      - \&#34;gcr.io/k8s-prow/generic-autobumper:*\&#34;&#34;]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPPrivilegedContainer\nmetadata:\n  name: psp-privileged-container\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;default\&#34;\n  parameters:\n    exemptImages:\n      - gcr.io/k8s-prow/entrypoint:*\n      - gcr.io/k8s-prow/initupload:*\n      - gcr.io/k8s-prow/clonerefs:*\n      - gcr.io/k8s-prow/sidecar:*\n      - \&#34;aquasec/trivy:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/prow/cleaner:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/bootstrap:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/gardener-rotate:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/golangci-lint:*\&#34;\n      - \&#34;eu.gcr.io/kyma-project/test-infra/kyma-integration:*\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\&#34;\n      - \&#34;gcr.io/k8s-prow/generic-autobumper:*\&#34;&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.trusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPPrivilegedContainer\nmetadata:\n  name: psp-privileged-container\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    exemptImages:\n      - gcr.io/k8s-prow/entrypoint:*\n      - gcr.io/k8s-prow/initupload:*\n      - gcr.io/k8s-prow/clonerefs:*\n      - gcr.io/k8s-prow/sidecar:*\n      - \"aquasec/trivy:*\"\n      - \"eu.gcr.io/kyma-project/prow/cleaner:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/gardener-rotate:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/golangci-lint:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev/e2e-nodejs-chrome:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/testimages/e2e-dind-k3d:*\"\n      - \"gcr.io/k8s-prow/generic-autobumper:*\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sPSPPrivilegedContainer"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "psp-privileged-container"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sPSPPrivilegedContainer
            metadata:
              name: psp-privileged-container
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - default
              parameters:
                exemptImages:
                - gcr.io/k8s-prow/entrypoint:*
                - gcr.io/k8s-prow/initupload:*
                - gcr.io/k8s-prow/clonerefs:*
                - gcr.io/k8s-prow/sidecar:*
                - aquasec/trivy:*
                - eu.gcr.io/kyma-project/prow/cleaner:*
                - eu.gcr.io/kyma-project/test-infra/bootstrap:*
                - eu.gcr.io/kyma-project/test-infra/buildpack-golang:*
                - eu.gcr.io/kyma-project/test-infra/gardener-rotate:*
                - eu.gcr.io/kyma-project/test-infra/golangci-lint:*
                - eu.gcr.io/kyma-project/test-infra/kyma-integration:*
                - eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*
                - eu.gcr.io/sap-kyma-neighbors-dev/e2e-nodejs-chrome:*
                - europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*
                - europe-docker.pkg.dev/kyma-project/prod/testimages/e2e-dind-k3d:*
                - gcr.io/k8s-prow/generic-autobumper:*
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.trusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPPrivilegedContainer\nmetadata:\n  name: psp-privileged-container\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    exemptImages:\n      - gcr.io/k8s-prow/entrypoint:*\n      - gcr.io/k8s-prow/initupload:*\n      - gcr.io/k8s-prow/clonerefs:*\n      - gcr.io/k8s-prow/sidecar:*\n      - \"aquasec/trivy:*\"\n      - \"eu.gcr.io/kyma-project/prow/cleaner:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/gardener-rotate:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/golangci-lint:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n      - \"gcr.io/k8s-prow/generic-autobumper:*\""] will be destroyed
  # (because key ["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPPrivilegedContainer\nmetadata:\n  name: psp-privileged-container\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    exemptImages:\n      - gcr.io/k8s-prow/entrypoint:*\n      - gcr.io/k8s-prow/initupload:*\n      - gcr.io/k8s-prow/clonerefs:*\n      - gcr.io/k8s-prow/sidecar:*\n      - \"aquasec/trivy:*\"\n      - \"eu.gcr.io/kyma-project/prow/cleaner:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/gardener-rotate:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/golangci-lint:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n      - \"gcr.io/k8s-prow/generic-autobumper:*\""] is not in for_each map)
  - resource "kubectl_manifest" "constraints" {
      - api_version             = "constraints.gatekeeper.sh/v1beta1" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/constraints.gatekeeper.sh/v1beta1/k8spspprivilegedcontainers/psp-privileged-container" -> null
      - kind                    = "K8sPSPPrivilegedContainer" -> null
      - live_manifest_incluster = (sensitive value)
      - live_uid                = "19ccf1f0-e417-4899-be4a-b6f4f762a703" -> null
      - name                    = "psp-privileged-container" -> null
      - server_side_apply       = false -> null
      - uid                     = "19ccf1f0-e417-4899-be4a-b6f4f762a703" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value)
      - yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sPSPPrivilegedContainer
            metadata:
              name: psp-privileged-container
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - default
              parameters:
                exemptImages:
                - gcr.io/k8s-prow/entrypoint:*
                - gcr.io/k8s-prow/initupload:*
                - gcr.io/k8s-prow/clonerefs:*
                - gcr.io/k8s-prow/sidecar:*
                - aquasec/trivy:*
                - eu.gcr.io/kyma-project/prow/cleaner:*
                - eu.gcr.io/kyma-project/test-infra/bootstrap:*
                - eu.gcr.io/kyma-project/test-infra/buildpack-golang:*
                - eu.gcr.io/kyma-project/test-infra/gardener-rotate:*
                - eu.gcr.io/kyma-project/test-infra/golangci-lint:*
                - eu.gcr.io/kyma-project/test-infra/kyma-integration:*
                - eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*
                - europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*
                - gcr.io/k8s-prow/generic-autobumper:*
        EOT -> null
      - yaml_incluster          = (sensitive value)
    }

  # module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPPrivilegedContainer\nmetadata:\n  name: psp-privileged-container\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    exemptImages:\n      - gcr.io/k8s-prow/entrypoint:*\n      - gcr.io/k8s-prow/initupload:*\n      - gcr.io/k8s-prow/clonerefs:*\n      - gcr.io/k8s-prow/sidecar:*\n      - \"aquasec/trivy:*\"\n      - \"eu.gcr.io/kyma-project/prow/cleaner:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/gardener-rotate:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/golangci-lint:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev/e2e-nodejs-chrome:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/testimages/e2e-dind-k3d:*\"\n      - \"gcr.io/k8s-prow/generic-autobumper:*\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sPSPPrivilegedContainer"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "psp-privileged-container"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sPSPPrivilegedContainer
            metadata:
              name: psp-privileged-container
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - default
              parameters:
                exemptImages:
                - gcr.io/k8s-prow/entrypoint:*
                - gcr.io/k8s-prow/initupload:*
                - gcr.io/k8s-prow/clonerefs:*
                - gcr.io/k8s-prow/sidecar:*
                - aquasec/trivy:*
                - eu.gcr.io/kyma-project/prow/cleaner:*
                - eu.gcr.io/kyma-project/test-infra/bootstrap:*
                - eu.gcr.io/kyma-project/test-infra/buildpack-golang:*
                - eu.gcr.io/kyma-project/test-infra/gardener-rotate:*
                - eu.gcr.io/kyma-project/test-infra/golangci-lint:*
                - eu.gcr.io/kyma-project/test-infra/kyma-integration:*
                - eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*
                - eu.gcr.io/sap-kyma-neighbors-dev/e2e-nodejs-chrome:*
                - europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*
                - europe-docker.pkg.dev/kyma-project/prod/testimages/e2e-dind-k3d:*
                - gcr.io/k8s-prow/generic-autobumper:*
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPPrivilegedContainer\nmetadata:\n  name: psp-privileged-container\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    exemptImages:\n      - gcr.io/k8s-prow/entrypoint:*\n      - gcr.io/k8s-prow/initupload:*\n      - gcr.io/k8s-prow/clonerefs:*\n      - gcr.io/k8s-prow/sidecar:*\n      - \"aquasec/trivy:*\"\n      - \"eu.gcr.io/kyma-project/prow/cleaner:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/gardener-rotate:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/golangci-lint:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n      - \"gcr.io/k8s-prow/generic-autobumper:*\""] will be destroyed
  # (because key ["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPPrivilegedContainer\nmetadata:\n  name: psp-privileged-container\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    exemptImages:\n      - gcr.io/k8s-prow/entrypoint:*\n      - gcr.io/k8s-prow/initupload:*\n      - gcr.io/k8s-prow/clonerefs:*\n      - gcr.io/k8s-prow/sidecar:*\n      - \"aquasec/trivy:*\"\n      - \"eu.gcr.io/kyma-project/prow/cleaner:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/gardener-rotate:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/golangci-lint:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n      - \"gcr.io/k8s-prow/generic-autobumper:*\""] is not in for_each map)
  - resource "kubectl_manifest" "constraints" {
      - api_version             = "constraints.gatekeeper.sh/v1beta1" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/constraints.gatekeeper.sh/v1beta1/k8spspprivilegedcontainers/psp-privileged-container" -> null
      - kind                    = "K8sPSPPrivilegedContainer" -> null
      - live_manifest_incluster = (sensitive value)
      - live_uid                = "ca0fdbcd-2fb2-45da-abab-c14f5b43525a" -> null
      - name                    = "psp-privileged-container" -> null
      - server_side_apply       = false -> null
      - uid                     = "ca0fdbcd-2fb2-45da-abab-c14f5b43525a" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value)
      - yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sPSPPrivilegedContainer
            metadata:
              name: psp-privileged-container
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - default
              parameters:
                exemptImages:
                - gcr.io/k8s-prow/entrypoint:*
                - gcr.io/k8s-prow/initupload:*
                - gcr.io/k8s-prow/clonerefs:*
                - gcr.io/k8s-prow/sidecar:*
                - aquasec/trivy:*
                - eu.gcr.io/kyma-project/prow/cleaner:*
                - eu.gcr.io/kyma-project/test-infra/bootstrap:*
                - eu.gcr.io/kyma-project/test-infra/buildpack-golang:*
                - eu.gcr.io/kyma-project/test-infra/gardener-rotate:*
                - eu.gcr.io/kyma-project/test-infra/golangci-lint:*
                - eu.gcr.io/kyma-project/test-infra/kyma-integration:*
                - eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*
                - europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*
                - gcr.io/k8s-prow/generic-autobumper:*
        EOT -> null
      - yaml_incluster          = (sensitive value)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with kubernetes_service_account.trusted_workload_terraform_executor,
  on terraform-executor.tf line 35, in resource "kubernetes_service_account" "trusted_workload_terraform_executor":
  35: resource "kubernetes_service_account" "trusted_workload_terraform_executor" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and one more similar warning elsewhere)

```



<!-- github-comment: {"Command":"plan","PRNumber":7941,"Program":"tfcmt","SHA1":"913c7cfc0905058c33576cf02b3e3a13d2676a68","Vars":{}} -->